Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh99-v2.tmx
Source language: bo
Languages: en

source: ཆོས་ཀྱི་ཁམས་ཤེས་ཏེ། ཆོས་ཀྱི་ཁམས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས། ཆོས་ཀྱི་ཁམས་ཤེས་པ་འགོག་པ་ཤེས། ཆོས་ཀྱི་ཁམས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་སོ། །
en: “He [correctly understands] the knowledge of the mental object element, the knowledge of the origin as related to knowledge of the mental object element, the knowledge of cessation as related to knowledge of the mental object element, and the knowledge of the path that leads to cessation as related to knowledge of the mental object element.

source: ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་ཤེས་ཏེ། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་ཤེས་པ་འགོག་པ་ཤེས། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: “He [correctly understands] the knowledge of the mind consciousness element, the knowledge of the origin as related to knowledge of the mind consciousness element, the knowledge of cessation as related to knowledge of the mind consciousness element, and the knowledge of the path that leads to cessation as related to knowledge of the mind consciousness element.

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་མིག་གི་ཁམས་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the eye element.

source: ཟིན་པའི་འབྱུང་བ་ཆེན་པོའི་རྒྱུར་བྱས་པ་དང་བ་གང་ཡིན་པ་ནི་མིག་གི་རྣམ་པར་སྨིན་པ་སྟེ།
en: The eye is the ripening of subtle matter derived from the primary elements conjoined with mind.

source: གང་གི་མིག་ལ་གཟུགས་སུ་སྣང་བར་འགྱུར་ཞིང་།
en: Within the eye, forms are perceived.

source: གཟུགས་ཀྱང་ཐོགས་པ་དང་། མིག་གཟུགས་རྣམས་ལ་ཐོགས་པ་གང་ཡིན་པ་དང་། གང་དུ་མིག་ཀྱང་གཟུགས་ལ་ཐོགས་པ་དང་།
en: Forms obstruct the eye, and it obstructs forms.

source: མིག་གང་གིས་གཟུགས་མཐོང་བ་དང་། ལྟ་བ་དང་། ལྟ་བར་འགྱུར་བ་དང་།
en: The eye has seen, it sees, and it will see forms.

source: གཟུགས་མཐོང་བར་བྱ་བའི་ཕྱིར་རྟག་ཏུ་ཐ་མི་དད་པར་རུང་བའི་མིག་གང་ཡིན་པ་དང་།
en: In order to perceive form, the eye is always undifferentiated.

source: ཁམས་བཅྭ་བརྒྱད་དག་ལས་མིག་གི་ཁམས་གང་ཡིན་པ་དང་།
en: The eye is also included within the eighteen elements as the eye element.

source: སྐྱེ་མཆེད་བཅུ་གཉིས་དག་ལས་མིག་གི་སྐྱེ་མཆེད་གང་ཡིན་པ་དང་།
en: Among the twelve sense sources it is the eye sense source.

source: དབང་པོ་ཉི་ཤུ་རྩ་གཉིས་དག་ལས་མིག་གི་དབང་པོ་གང་ཡིན་པ་སྟེ།
en: Among the twenty-two faculties it is the eye faculty.

source: དེ་ནི་མིག་ཀྱང་ཡིན།
en: That is the eye.

source: དེ་ནི་མིག་གི་ཁམས་ཀྱང་ཡིན།
en: It is the eye element;

source: དེ་ནི་མིག་གི་སྐྱེ་མཆེད་ཀྱང་ཡིན།
en: it is the eye sense source;

source: དེ་ནི་མིག་གི་དབང་པོ་ཡང་ཡིན།
en: it is the eye faculty.

source: དེ་ནི་སྒོ་ཡང་ཡིན།
en: It is a gateway.

source: དེ་ནི་དཀར་བ་ཡང་ཡིན།
en: It is white.

source: དེ་ནི་རྒྱུན་ཀྱང་ཡིན། དེ་ནི་མཚོ་ཡང་ཡིན། དེ་ནི་རྒྱ་མཚོ་ཡང་ཡིན།
en: It is a stream, a lake, an ocean.

source: དེ་ནི་ཀློང་ཡང་ཡིན།
en: It is an expanse.

source: དེ་ནི་སྣང་བ་ཡང་ཡིན།
en: It is light.

source: དེ་ནི་ཆུ་འབྱུང་ཡང་ཡིན།
en: It is a water source.

source: དེ་ནི་ཁྲིད་བྱེད་ཀྱང་ཡིན།
en: It is a leader.

source: དེ་ནི་འདྲེན་བྱེད་ཀྱང་ཡིན།
en: It is a guide.

source: དེ་ནི་གཞི་ཡང་ཡིན།
en: It is a foundation.

source: དེ་ནི་སྦུབས་ཀྱང་ཡིན།
en: It is internal.

source: དེ་ནི་གསང་བ་ཡང་ཡིན།
en: It is secret.

source: དེ་ནི་ཞིང་ཡང་ཡིན།
en: It is a field.

source: དེ་ནི་ཕ་རོལ་གྱི་འགྲམ་མ་ཡིན་པ་ཡང་ཡིན།
en: It is not transcendent.

source: དེ་ནི་བདུད་ཀྱི་སྣོད་ཀྱང་ཡིན།
en: It is the vessel of the demons.

source: དེ་ནི་བདག་གི་དངོས་པོར་འཇུག་པ་ཡང་ཡིན།
en: It engages with the entities of the self.

source: དེ་ནི་གྲོང་སྟོང་པར་འཇུག་པ་ཡང་ཡིན།
en: It enters the empty city.

source: དེ་ནི་མངོན་པར་ཤེས་པར་བྱ་བ་ཡང་ཡིན།
en: It is to be known in full.

source: དེ་ནི་ཡོངས་སུ་ཤེས་པར་བྱ་བ་ཡང་ཡིན།
en: It is to be known completely.

source: དེ་ནི་སྤང་བར་བྱ་བ་ཡང་ཡིན་ཏེ།
en: It is to be abandoned.

source: འདི་ནི་མིག་གི་ཁམས་ཞེས་བྱའོ། །
en: It is known as the eye element.

source: དེ་ལ་ཤེས་པ་དང་། མཐོང་བ་དང་། གསལ་བ་དང་། མངོན་པར་རྟོགས་པ་དང་། ཡང་དག་པར་ཁོང་དུ་ཆུད་པ་དང་། མཁས་པ་གང་ཡིན་པ་འདི་ནི་མིག་གི་ཁམས་ཤེས་པ་ཞེས་བྱ་སྟེདེ་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: To know, see, perceive, realize, understand, and be skillful about this is called knowing the eye element , and that is what the Thus-Gone One correctly understands.

source: དེ་བཞིན་གཤེགས་པ་མིག་གི་ཁམས་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the eye element,

source: འདི་ལྟར་དེ་བཞིན་གཤེགས་པས་ཆོས་ཀྱི་དབྱིངས་བླ་ན་མེད་པ་མཁྱེན་རབ་ཀྱིས་ཤིན་ཏུ་ཐུགས་སུ་ཆུད་པར་མཛད་ཅིང་། གང་ཐུགས་སུ་ཆུད་པའི་དེ་བཞིན་གཤེགས་པ་མིག་གི་ཁམས་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན། སྤོབས་པ་ཟད་མི་ཤེས་སོ། །
en: It is because in his wisdom the Thus-Gone One knows the matchless sphere of reality. In this way the Thus-Gone One possesses inexhaustible eloquence when asked about the knowledge of the eye element.

source: ཁྱིམ་བདག་དེ་ལྟ་བས་ན། འདིར་གང་གི་ཡེ་ཤེས་མཐོང་བ་ཐོགས་པ་མེད་པ་འཇུག་པ་དེ་ནི། ཙན་དན་གྱི་ཁྱམས་དང་ཁང་བཟངས་ཀྱི་བར་འདི་ལ་ལོངས་སྤྱོད་པར་འགྱུར་རོ། །
en: Householder, therefore, with his unimpeded wisdom vision he will enjoy this temple with its sandalwood courtyard.

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་མིག་གི་ཁམས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the origin as related to knowledge of the eye element.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དཔག་ཏུ་མེད་པ་རྣམས་ལ་དགེ་བའི་རྩ་བ་བསྐྱེད་ནས། མིག་གི་ཁམས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཡང་དག་པར་འགྲུབ་པ་དེ། དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: The Thus-Gone One correctly understands that knowledge of the origin as related to knowledge of the eye element is acquired from accumulating roots of virtue in the presence of limitless blessed buddhas.

source: ཁྱིམ་བདག་གཞན་ཡང་དེ་བཞིན་གཤེགས་པས་རྒྱུ་གང་དང་རྐྱེན་གང་དག་གིས་མིག་གི་ཁམས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཡང་དག་པར་འགྲུབ་པའི་རྒྱུ་དེ་དང་རྐྱེན་དེ་དག་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ
en: Householder, moreover, the Thus-Gone One correctly understands those causes and conditions that accomplish knowledge of the origin as related to knowledge of the eye element.

source: གལ་ཏེ་མི་རྟག་པར་རྗེས་སུ་ལྟ་བར་གནས་པ་ནས། གལ་ཏེ་ཕྱིར་རྒོལ་བར་རྗེས་སུ་ལྟ་བར་གནས་པའི་བར་དེ་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: The Thus-Gone One has a correct understanding, whether he considers impermanence, and so forth, up until . . . whether he considers opposition.

source: དེ་བཞིན་གཤེགས་པ་མིག་གི་ཁམས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the origin as related to knowledge of the eye element,

source: བསྐལ་པར་ལན་གསུང་བ་ནས། བསྐལ་པ་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་བར་དག་ལ་ལན་གསུང་སྟེ།
en: he can respond for an eon, and so forth, up until an inexpressible number of inexpressible eons, since

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་མིག་གི་ཁམས་ཤེས་པ་འགོག་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of cessation as related to knowledge of the eye element.

source: སེམས་ཅན་དཔག་ཏུ་མེད་པ་རྣམས་ཀྱི་དོན་བྱས་ཤིང་དོན་མ་ཡིན་པ་ཟློག་ལ།
en: He accomplished the welfare of an immeasurable number of beings and refrained from harming them.

source: སེམས་ཅན་དཔག་ཏུ་མེད་པ་རྣམས་སྡུག་བསྔལ་ལས་ཡོངས་སུ་ཐར་བར་བྱས་ནས། བདེ་བ་ལ་བཙུད་པ་ནི་མིག་གི་ཁམས་ཤེས་པ་འགོག་པ་ཤེས་པ་སྟེ།
en: He has freed innumerable beings from suffering and established them in happiness. That is the knowledge of cessation as related to knowledge of the eye element.

source: ཁྱིམ་བདག་དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་མིག་གི་ཁམས་ཤེས་པ་འགོག་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Householder, this is how the Thus-Gone One correctly understands the knowledge of cessation as related to knowledge of the eye element.

source: དེ་བཞིན་གཤེགས་པ་མིག་གི་ཁམས་ཤེས་པ་འགོག་པ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན། བསྐལ་པར་ལན་གསུང་བ་ནས། བསྐལ་པ་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་བར་དག་ཏུ་ལན་གསུང་སྟེ།
en: When the Thus-Gone One is asked about the knowledge of cessation as related to knowledge of the eye element, he can respond for an eon, and so forth, up until an inexpressible number of inexpressible eons, since

source: དེ་བཞིན་དུ་སྦྱར་ཏེ་དེ་ནི་ཙན་དན་གྱི་ཁྱམས་དང་། ཁང་བཟངས་ཀྱི་བར་འདི་ལ་ལོངས་སྤྱོད་པར་འགྱུར་རོ། །
en: Therefore, he will enjoy this temple with its sandalwood courtyard.

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་མིག་གི་ཁམས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན། །
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the path that leads to cessation as related to knowledge of the eye element.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པ་ཤེས་པ་གང་གིས་མིག་གི་ཁམས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡོངས་སུ་ཤེས། ཁོང་དུ་ཆུད། མངོན་སུམ་དུ་བྱས་པའི་འགོག་པ།
en: Householder, the Thus-Gone One correctly understands the knowledge of cessation by which he knows, understands, and actualizes the knowledge of the path that leads to cessation as related to knowledge of the eye element.

source: གལ་ཏེ་རོ་མྱང་བ་མེད་པར་རྗེས་སུ་ལྟ་བར་གནས་པའམ། གལ་ཏེ་ཉེས་དམིགས་སུ་རྗེས་སུ་ལྟ་བར་གནས་པའམ། གལ་ཏེ་ངེས་པར་འབྱུང་བར་རྗེས་སུ་ལྟ་བར་གནས་པ་དེ།
en: Whether he contemplates insipidity, or whether he contemplates shortcomings, or whether he contemplates deliverance,

source: དེ་བཞིན་གཤེགས་པ་མིག་གི་ཁམས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the path that leads to cessation as related to knowledge of the eye element,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་གཟུགས་ཀྱི་ཁམས་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the form element.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པས་གཟུགས་ཀྱི་ཁ་དོག་དང་། དབྱིབས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: Householder, the Thus-Gone One correctly understands the color and shape of form in this way:

source: འདི་ལྟ་སྟེ། ཁ་དོག་བཟང་པོ་དང་། ཁ་དོག་ངན་པ་དང་། དབྱིབས་ལེགས་པ་དང་། དབྱིབས་མ་ལེགས་པ་དང་། མདོག་བཟང་བ་དང་། མདོག་ངན་པ་དང་། ཁ་དོག་ངན་པ་དང་། ཁ་དོག་བཟང་བའི་ཁ་དོག་དང་། མདོག་ནག་པོ་དང་། སེར་པོ་དང་། སོ་མདོག་ལྟ་བུ་དང་། དམར་པོ་དང་། དཀར་པོ་དང་། བཙོད་ཀ་དང་། ཤེལ་མདོག་དང་། གྲུ་བཞི་དང་། ཆ་དྲུག་པ་དང་། ཆ་བརྒྱད་པ་དང་། ཆ་བཅུ་དྲུག་པ་དང་། ཟུར་གསུམ་པ་དང་། དམའ་བ་དང་། མཐོ་བ་དང་། མཉམ་པ་དང་། མི་མཉམ་པ་དང་། གྲིབ་མ་དང་། ཉི་མ་དང་། སྤྲིན་དང་། སྤྲིན་མེད་པ་དང་། དུ་བ་དང་། རྡུལ་དང་། སྒྱུ་མ་དང་། སྨིག་རྒྱུ་དང་། སྣང་བ་དང་། མུན་པ་དང་། མཚན་མ་སྣང་བ་འདི་ནི་གཟུགས་ཀྱི་ཁམས་ཞེས་བྱ་སྟེ
en: It consists of beautiful colors, ugly colors, fine shapes, coarse shapes, beautiful hues, ugly hues, shades that are ugly, shades that are fine, black colors, and yellow, whitish, red, white, vermillion, and crystal colors. It consists of shapes that are squares, hexagons, octagons, hexadecagons, and triangles; low, tall, even, and uneven; as well as colors that are shady, sunny, cloudy, cloudless, smoky, dusty, illusive, illusory, bright, dark, and distinctive. Such is the form element.

source: དེ་ལ་ཤེས་པ་དང་། མཐོང་བ་དང་། གསལ་བ་དང་། མངོན་པར་རྟོགས་པ་དང་། ཡང་དག་པར་ཁོང་དུ་ཆུད་པ་དང་། མཁས་པ་གང་ཡིན་པ་འདི་ནི་གཟུགས་ཀྱི་ཁམས་ཤེས་པ་ཞེས་བྱ་སྟེདེ་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: To know, see, perceive, realize, understand, and be skillful about this is called knowing the form element , and that is how the Thus-Gone One correctly understands the form element.

source: དེ་བཞིན་གཤེགས་པ་གཟུགས་ཀྱི་ཁམས་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the form element,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་གཟུགས་ཀྱི་ཁམས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the origin as related to knowledge of the form element.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དཔག་ཏུ་མེད་པ་རྣམས་ལ་དགེ་བའི་རྩ་བ་བསྐྱེད་ནས།
en: having accumulated roots of virtue in the presence of limitless blessed buddhas.

source: གཟུགས་ཀྱི་ཁམས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཡང་དག་པར་འགྲུབ་པ་དེ། དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: The Thus-Gone One correctly understands how to gain knowledge of the origin as related to knowledge of the form element,

source: ཁྱིམ་བདག་གཞན་ཡང་དེ་བཞིན་གཤེགས་པས་རྒྱུ་གང་དང་རྐྱེན་གང་དག་གིས་གཟུགས་ཀྱི་ཁམས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཡང་དག་པར་འགྲུབ་པའི་རྒྱུ་དེ་དང་རྐྱེན་དེ་དག་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ
en: Householder, moreover, the Thus-Gone One correctly understands those causes and conditions that accomplish knowledge of the origin as related to knowledge of the form element.

source: དེ་བཞིན་གཤེགས་པ་གཟུགས་ཀྱི་ཁམས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན། བསྐལ་པར་ལན་གསུང་བ་ནས། བསྐལ་པ་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་བར་དག་ཏུ་ལན་གསུང་སྟེ།
en: When the Thus-Gone One is asked about the knowledge of the origin as related to knowledge of the form element, he can respond for an eon, and so forth, up until an inexpressible number of inexpressible eons, since

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་གཟུགས་ཀྱི་ཁམས་ཤེས་པ་འགོག་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of cessation as related to knowledge of the form element.

source: བདེ་བ་ལ་བཙུད་པ་ནི་གཟུགས་ཀྱི་ཁམས་ཤེས་པ་འགོག་པ་ཤེས་པ་སྟེ།
en: That is the knowledge of cessation as related to knowledge of the form element.

source: ཁྱིམ་བདག་དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་གཟུགས་ཀྱི་ཁམས་ཤེས་པ་འགོག་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Householder, this is how the Thus-Gone One correctly understands the knowledge of cessation as related to knowledge of the form element.

source: དེ་བཞིན་གཤེགས་པ་གཟུགས་ཀྱི་ཁམས་ཤེས་པ་འགོག་པ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན། བསྐལ་པར་ལན་གསུང་བ་ནས། དེ་ནི་ཙན་དན་གྱི་ཁྱམས་དང་ཁང་བཟངས་ཀྱི་བར་འདི་ལ་ལོངས་སྤྱོད་པར་འགྱུར་རོ། །
en: When the Thus-Gone One is asked about the knowledge of cessation as related to knowledge of the form element, he can respond for an eon, and so forth, up until . . . . Therefore, he will enjoy this temple with its sandalwood courtyard.

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་གཟུགས་ཀྱི་ཁམས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the path that leads to cessation as related to knowledge of the form element.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པ་ཤེས་པ་གང་གིས་གཟུགས་ཀྱི་ཁམས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡོངས་སུ་ཤེས། ཁོང་དུ་ཆུད། མངོན་སུམ་དུ་བྱས་པའི་འགོག་པ་གལ་ཏེ་རོ་མྱང་བ་མེད་པར་རྗེས་སུ་ལྟ་བར་གནས་པའམ། གལ་ཏེ་ཉེས་དམིགས་སུ་རྗེས་སུ་ལྟ་བར་གནས་པའམ། གལ་ཏེ་ངེས་པར་འབྱུང་བར་རྗེས་སུ་ལྟ་བར་གནས་པ་
en: Householder, the Thus-Gone One correctly understands the knowledge of cessation by which he knows, understands, and actualizes the knowledge of the path that leads to cessation as related to knowledge of the form element, whether he contemplates insipidity, or whether he contemplates shortcomings, or whether he contemplates deliverance.

source: འདི་ནི། གཟུགས་ཀྱི་ཁམས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཞེས་བྱ་སྟེ
en: That is known as knowledge of the path that leads to cessation as related to knowledge of the form element .

source: དེ་བཞིན་གཤེགས་པ་གཟུགས་ཀྱི་ཁམས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the path that leads to cessation as related to knowledge of the form element,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་མིག་གི་རྣམ་པར་ཤེས་པའི་ཁམས་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the eye consciousness element.

source: མིག་དང་གཟུགས་ལ་བརྟེན་ནས། མིག་གི་རྣམ་པར་ཤེས་པ་སྐྱེ་སྟེ།
en: The eye consciousness manifests based on the eye and form.

source: དངོས་པོ་སོ་སོར་རྣམ་པར་རིག་པའི་མཚན་ཉིད་དེ་སྐྱེ་བ་ན།
en: When the features of cognized entities manifest,

source: ནང་གི་མིག་ལས་ཀྱང་མ་བྱུང་།
en: the eye consciousness does not arise from within the eye.

source: ཕྱི་རོལ་གྱི་གཟུགས་ལས་ཀྱང་མ་འོངས།
en: It also does not appear from the outer forms.

source: བར་དུ་རྣམ་པར་བཟུང་སྟེ།
en: Although it apprehends in between, it does not abide there either.

source: ཡང་མི་གནས་མོད་ཀྱི། འོན་ཀྱང་མིག་དང་གཟུགས་ལ་བརྟེན་ནས། མིག་གི་རྣམ་པར་ཤེས་པ་སྐྱེ་སྟེ།
en: Nevertheless, based on the eye and form, the eye consciousness does manifest.

source: དེ་བཞིན་གཤེགས་པ་མིག་གི་རྣམ་པར་ཤེས་པའི་ཁམས་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the eye consciousness element,

source: བསྐལ་པར་ལན་གསུང་བ་ནས། དེ་བཞིན་དུ་སྦྱར་ཏེ་དེ་ནི་ཙན་དན་གྱི་ཁྱམས་དང་ཁང་བཟངས་ཀྱི་བར་འདི་ལ་ལོངས་སྤྱོད་པར་འགྱུར་རོ། །
en: he can respond for an eon, and so forth, up until . . . . Therefore, he will enjoy this temple with its sandalwood courtyard.

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་མིག་གི་རྣམ་པར་ཤེས་པའི་ཁམས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the origin as related to knowledge of the eye consciousness element.

source: མིག་གི་རྣམ་པར་ཤེས་པའི་ཁམས་ཤེས་པ། ཀུན་འབྱུང་བ་ཤེས་པ་ཡང་དག་པར་འགྲུབ་པ་དེ། དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: The Thus-Gone One correctly understands how to gain knowledge of the origin as related to knowledge of the eye consciousness element,

source: ཁྱིམ་བདག་གཞན་ཡང་དེ་བཞིན་གཤེགས་པས་འདི་ལྟར་རབ་ཏུ་མཁྱེན་ཏེ། རྒྱུ་གང་དང་རྐྱེན་གང་དག་གིས་མིག་གི་རྣམ་པར་ཤེས་པའི་ཁམས་ཤེས་པ། ཀུན་འབྱུང་བ་ཤེས་པ་ཡང་དག་པར་འགྲུབ་པའི་རྒྱུ་དེ་དང་རྐྱེན་དེ་དག་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ
en: Householder, moreover, the Thus-Gone One correctly understands those causes and conditions that accomplish knowledge of the origin as related to knowledge of the eye consciousness element.

source: གལ་ཏེ་མི་རྟག་པར་རྗེས་སུ་ལྟ་བར་གནས་པའམ། གལ་ཏེ་ཕྱིར་རྒོལ་བར་རྗེས་སུ་ལྟ་བར་གནས་པའི་བར་དེ། དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: The Thus-Gone One has a correct understanding, whether he considers impermanence, and so forth, up until . . . whether he considers opposition.

source: དེ་བཞིན་གཤེགས་པ་མིག་གི་རྣམ་པར་ཤེས་པའི་ཁམས་ཤེས་པ། ཀུན་འབྱུང་བ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the origin as related to knowledge of the eye consciousness element,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་མིག་གི་རྣམ་པར་ཤེས་པའི་ཁམས་ཤེས་པ། འགོག་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of cessation as related to knowledge of the eye consciousness element.

source: སེམས་ཅན་དཔག་ཏུ་མེད་པ་རྣམས་སྡུག་བསྔལ་ལས་ཡོངས་སུ་ཐར་བར་མཛད་ནས། བདེ་བ་ལ་བཙུད་པ་ནི་མིག་གི་རྣམ་པར་ཤེས་པའི་ཁམས་ཤེས་པ་འགོག་པ་ཤེས་པ་སྟེ།
en: He has freed innumerable beings from suffering and established them in happiness. That is the knowledge of cessation as related to knowledge of the eye consciousness element.

source: ཁྱིམ་བདག་དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་མིག་གི་རྣམ་པར་ཤེས་པའི་ཁམས་ཤེས་པ་འགོག་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Householder, this is how the Thus-Gone One correctly understands the knowledge of cessation as related to knowledge of the eye consciousness element.

source: དེ་བཞིན་གཤེགས་པས་མིག་གི་ཁམས་ཤེས་པ་འགོག་པ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of cessation as related to knowledge of the eye consciousness element,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་མིག་གི་རྣམ་པར་ཤེས་པའི་ཁམས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the path that leads to cessation as related to knowledge of the eye consciousness element.

source: ཤེས་པ་གང་གིས་མིག་གི་རྣམ་པར་ཤེས་པ་ཡོངས་སུ་ཤེས། ཁོང་དུ་ཆུད་མངོན་སུམ་དུ་བྱས་པའི་འགོག་པ་ཤེས་པ་དེ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: He correctly understands the knowledge of cessation by which he knows, understands, and actualizes the knowledge of the eye consciousness element.

source: གལ་ཏེ་རོ་མྱང་བ་མེད་པར་རྗེས་སུ་ལྟ་བའམ། གལ་ཏེ་ཉེས་དམིགས་སུ་རྗེས་སུ་ལྟ་བར་གནས་པའམ། གལ་ཏེ་ངེས་པར་འབྱུང་བར་རྗེས་སུ་ལྟ་བར་གནས་པ་དེ་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Whether he contemplates insipidity, or whether he contemplates shortcomings, or whether he contemplates deliverance, the Thus-Gone One correctly understands.

source: དེ་བཞིན་གཤེགས་པས་མིག་གི་རྣམ་པར་ཤེས་པའི་ཁམས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the path that leads to cessation as related to knowledge of the eye consciousness element,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་རྣ་བའི་ཁམས་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the ear element.

source: ཟིན་པའི་འབྱུང་བ་ཆེན་པོའི་རྒྱུར་བྱས་པ་གང་ཡིན་པ་དང་། དང་བ་གང་ཡིན་པ་ནི་རྣ་བའི་རྣམ་པར་སྨིན་པ་སྟེ།
en: The ear is the ripening of subtle matter derived from the primary elements conjoined with mind.

source: གང་གི་རྣ་བ་ལ་སྒྲར་སྣང་བར་འགྱུར་ཞིང་།
en: Within the ear, sounds are perceived.

source: རྣ་བ་གང་སྒྲ་ལ་ཐོགས་པ་དང་། རྣ་བ་གང་ལ་སྒྲ་ཐོགས་པ་དང་།
en: The ear is obstructed by sounds, and it obstructs sounds.

source: རྣ་བ་གང་གིས་སྒྲ་ཐོས་པར་གྱུར་པ་དང་། ཐོས་པ་དང་། ཐོས་པར་འགྱུར་བ་དང་།
en: The ear has heard, it hears, and it will hear sounds.

source: སྒྲ་དག་ཐོས་པར་བྱ་བའི་ཕྱིར་ཡང་རྟག་ཏུ་ཐ་མི་དད་ཅིང་རུང་བའི་རྣ་བ་གང་ཡིན་པ་དང་།
en: In order to perceive sounds, the ear is always undifferentiated.

source: ཁམས་བཅྭ་བརྒྱད་དག་ལས་རྣ་བའི་ཁམས་གང་ཡིན་པ་དང་།
en: The ear is also included within the eighteen elements as the ear element.

source: སྐྱེ་མཆེད་བཅུ་གཉིས་དག་ལས་རྣ་བའི་སྐྱེ་མཆེད་གང་ཡིན་པ་དང་།
en: Among the twelve sense sources it is the ear sense source.

source: དབང་པོ་ཉི་ཤུ་རྩ་གཉིས་དག་ལས་རྣ་བའི་དབང་པོ་གང་ཡིན་པ་སྟེ།
en: Among the twenty-two faculties it is the ear faculty.

source: དེ་ནི་རྣ་བ་ཡང་ཡིན།
en: That is the ear.

source: དེ་ནི་ཁམས་ཀྱང་ཡིན།
en: It is the ear element;

source: དེ་ནི་རྣ་བའི་སྐྱེ་མཆེད་ཀྱང་ཡིན།
en: it is the ear sense source;

source: དེ་ནི་རྣ་བའི་དབང་པོ་ཡང་ཡིན།
en: it is the ear faculty.

source: འདི་ནི་རྣ་བའི་ཁམས་ཞེས་བྱའོ། །
en: It is known as the ear element.

source: དེ་ལ་ཤེས་པ་དང་། མཐོང་བ་དང་། གསལ་བ་དང་། མངོན་པར་རྟོགས་པ་དང་། ཡང་དག་པར་ཁོང་དུ་ཆུད་པ་དང་། མཁས་པ་གང་ཡིན་པ་འདི་ནི་རྣ་བའི་ཁམས་ཤེས་པ་ཞེས་བྱ་སྟེ
en: To know, see, perceive, realize, understand, and be skillful about this is called knowing the ear element , and

source: དེ་བཞིན་གཤེགས་པ་རྣ་བའི་ཁམས་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the ear element,

source: དེ་ནི་ཙན་དན་གྱི་ཁྱམས་དང་ཁང་བཟངས་ཀྱི་བར་འདི་ལ་ལོངས་སྤྱོད་པར་འགྱུར་རོ།། །།
en: Therefore, he will enjoy this temple with its sandalwood courtyard.

source: བམ་པོ་གསུམ་པ། ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་རྣ་བའི་ཁམས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the origin as related to knowledge of the ear element.

source: རྣ་བའི་ཁམས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཡང་དག་པར་འགྲུབ་པ་དང་།
en: The Thus-Gone One correctly understands how to gain knowledge of the origin as related to knowledge of the ear element,

source: ཁྱིམ་བདག་གཞན་ཡང་དེ་བཞིན་གཤེགས་པས་རྒྱུ་གང་དང་རྐྱེན་གང་དག་གིས་རྣ་བའི་ཁམས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཡང་དག་པར་འགྲུབ་པའི་རྒྱུ་དེ་དང་རྐྱེན་དེ་དག་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ
en: Householder, moreover, the Thus-Gone One correctly understands those causes and conditions that accomplish knowledge of the origin as related to knowledge of the ear element.
